{
    "ranks" : {
        "Air Cadet": "As an Air Cadet with the rank of Air cadet (AC), the cadet begins their journey in the program, learning foundational skills in leadership, drill, and citizenship. This rank signifies the start of structured training and participation in squadron activities, fostering discipline and teamwork.",
        "Leading Air Cadet": "Leading Air cadet (LAC) is the second rank in the Air Cadet program, recognizing a cadet's progress in training and their growing responsibilities. LACs assist junior cadets and demonstrate commitment to squadron duties, leadership development, and community service.",
        "Corporal": "Corporal (CPL) is a junior non-commissioned rank in the Cadet Program. Cadets at this level have demonstrated leadership potential, completed initial training phases, and serve as role models for junior cadets",
        "Flight Corporal": "Flight Corporal (FCPL) is an intermediate leadership rank in the Air Cadet program. FCPLs are responsible for assisting in small party taskings, participating in training, and serving as role models in discipline, dress, and deportment.",
        "Sergeant": "Sergeant (SGT) is a senior cadet rank that reflects strong leadership, instructional ability, and commitment. Sergeants learn how to lead training sessions, mentor junior cadets, and play a key role in squadron operations and ceremonial duties, in preparation for their leadership journey.",
        "Flight Sergeant": "Flight Sergeant (FSGT) is a high-level leadership rank in the Air Cadet program. FSGTs coordinate training, manage teams, and support officers in planning and executing squadron activities. They are respected for their experience and professionalism.",
        "Warrant Officer Second Class": "Warrant Officer Second Class (WO2) is a prestigious rank awarded to cadets who have demonstrated exceptional leadership, instructional skills, and dedication. WO2s oversee large teams, mentor junior leaders, and contribute to strategic planning within the unit.",
        "Warrant Officer First Class": "Warrant Officer First Class (WO1) is the highest rank in the Air Cadet program. WO1s serve as the senior cadet leaders, representing the squadron at events, advising staff, and ensuring high standards across all cadet activities.",
        "Cadet": "Cadet (CDT) is the entry-level rank in the Army Cadet program. Cadets begin learning basic drill, leadership, and expedition skills, and participate in community service and physical fitness activities as part of their development.",
        "Lance Corporal": "Lance Corporal (LCPL) is a junior leadership rank in the Army Cadet program. LCPLs participate in training, work in small groups, and demonstrate initiative and responsibility in both field and classroom settings.",
        " Corporal ": "Corporal (CPL) is a junior non-commissioned rank in the Cadet Program. Cadets at this level have demonstrated leadership potential, completed initial training phases, and often mentor new cadets during activities and instruction.",
        "Master Corporal": "Master Corporal (MCPL) is a mid-level leadership rank in the Army Cadet program. MCPLs are responsible for mentoring junior cadets, leading small party taskings, and supporting the planning and delivery of training programs.",
        " Sergeant ": "Sergeant (SGT) is a senior cadet rank that reflects strong leadership, instructional ability, and commitment. Sergeants learn how to lead training sessions, mentor junior cadets, and play a key role in corps operations and ceremonial duties in preparation for their leadeship journey.",
        "Warrant Officer": "Warrant Officer (WO) in the Army Cadet program is a senior leadership rank. WOs manage teams, coordinate training, and serve as key advisors to officers, demonstrating advanced leadership and organizational skills.",
        "Master Warrant Officer": "Master Warrant Officer (MWO) is a high-level leadership rank in the Army Cadet program. MWOs oversee major training events, mentor junior leaders, and ensure discipline and professionalism throughout the corps.",
        "Chief Warrant Officer": "Chief Warrant Officer (CWO) is the highest rank in the Army Cadet program. CWOs represent the corps at official functions, lead strategic initiatives, and uphold the highest standards of leadership and conduct.",
        "Ordinary Cadet": "Ordinary Cadet is the entry-level rank in the Sea Cadet program. Ordinary cadets begin their training in seamanship, drill, leadership,  and community service.",
        "Able Cadet": "Able Cadet is the second rank in the Sea Cadet program. Able Cadets have completed basic training and begin participating in intermediate leadership training and demonstrate commitment to the community.",
        "Leading Cadet": "Leading Cadet is a junior leadership rank in the Sea Cadet program. Leading Cadets work in small teams, participate in training, and demonstrate strong seamanship and leadership skills.",
        "Master Cadet": "Master Cadet is a mid-level leadership rank in the Sea Cadet program. Master Cadets participate in training, and serve as role models in discipline and naval conduct.",
        "Petty Officer Second Class": "Petty Officer Second Class (PO2) is a senior leadership rank in the Sea Cadet program. PO2s participate in small teams, learn how to instruct, and support seniors in planning and executing training.",
        "Petty Officer First Class": "Petty Officer First Class (PO1) is a high-level leadership rank in the Sea Cadet program. PO1s oversee divisions, mentor junior cadets, and ensure high standards in all aspects of cadet life.",
        "Chief Petty Officer Second Class": "Chief Petty Officer Second Class (CPO2) is a prestigious rank in the Sea Cadet program. CPO2s coordinate major training events, represent the corps, and uphold naval traditions and leadership excellence.",
        "Chief Petty Officer First Class": "Chief Petty Officer First Class (CPO1) is the highest rank in the Sea Cadet program. CPO1s serve as senior cadet leaders, advising officers, leading corps initiatives, and exemplifying the highest standards of conduct."
    },
    "courses": {
        "Introduction to Marksmanship (ITM)": "Cadets develop foundational skills in air rifle safety, handling, and marksmanship techniques. The course emphasizes discipline, focus, and precision while practicing and promoting safe shooting habits. Cadets also begin developing leadership skills by mentoring junior members. Successful participants earn marksmanship qualifications that recognize their proficiency and safety awareness.",
        "Air Rifle Marksmanship Instructor (ARMI)": "This advanced course deepens cadets’ knowledge of air rifle marksmanship and safety protocols. Cadets learn instructional and coaching techniques to teach others effectively while maintaining rigorous safety standards. The course enhances communication, leadership, and organizational skills, and successful completion results in higher-level marksmanship qualifications.",
        "Introduction to Drill and Ceremonial (ITDC)": "Cadets acquire skills in basic drill movements and ceremonial protocols, fostering discipline, attention to detail, and teamwork. The course builds foundational leadership and instructional abilities useful for guiding junior cadets in parade and ceremonial duties.",
        "Drill and Ceremonial Instructor Course (DCI)": "Cadets receive advanced training in drill execution, ceremonial leadership, and instructional methods. They develop leadership, public presentation, and event management skills, enabling them to conduct parades and ceremonies and train others effectively.",
        "Introduction to Fitness and Sports (ITFS)": "This course introduces cadets to essential fitness principles and healthy lifestyle habits. Cadets develop self-motivation, goal-setting, and physical conditioning skills, supporting overall wellness and readiness.",
        "Fitness and Sports Instructor Course (FSI)": "Cadets expand their knowledge of fitness assessment, exercise programming, and health promotion. The course emphasizes leadership, coaching, and motivational techniques, preparing cadets to lead physical training sessions and promote team fitness.",
        "Introduction to Military Band (ITMB)": "Cadets develop musical skills including instrument handling, music reading, and ensemble playing, along with drill and ceremonial knowledge. The course enhances discipline, teamwork, and leadership within a band setting.",
        "Military Band Musician (MB)": "Building on foundational skills, cadets improve musical proficiency, leadership, and group coordination. They prepare for roles involving performance, instruction, and band leadership responsibilities.",
        "Introduction to Pipe Band (ITPB)": "Cadets acquire basic pipe band music skills, drill techniques, and ceremonial knowledge, fostering teamwork and leadership applicable to band activities.",
        "Pipe Band Musician (PB)": "Cadets refine advanced pipe band performance, leadership, and instructional skills. They prepare to lead and teach within musical units while supporting ceremonial functions.",
        "Cadet Correspondent": "Cadet Correspondents develop journalism and media production skills, including writing, photography, and video editing. They create engaging content that promotes cadet activities, improving communication, storytelling, technical media skills, and attention to detail. The role enhances leadership, initiative, and teamwork abilities through collaboration with cadet units and staff.",
        "Staff Cadet (SCdt)":  "The Staff Cadet role is a leadership and mentorship position where experienced cadets support the delivery of summer training programs. Staff Cadets assist instructors, supervise cadet activities, and ensure safety and discipline across training centers. They develop advanced leadership, instructional, and organizational skills while serving as role models for junior cadets. This position fosters responsibility, teamwork, and professionalism, preparing cadets for future leadership roles in and beyond the Cadet Program.",
        "National Cadet Advisory Council (NCAC)": "The National Cadet Advisory Council is a prestigious leadership opportunity where selected cadets represent their peers at the national level. Council members collaborate with senior staff to provide feedback, propose initiatives, and influence the future of the Cadet Program. Through meetings, presentations, and consultations, cadets develop strategic thinking, communication, and advocacy skills, playing a vital role in shaping a positive and inclusive cadet experience across Canada.",
        "IT Internship": "The IT Internship role offers cadets the opportunity to support critical digital operations within cadet training centres and teams. As Assistant IT Coordinators at CTCs, cadets gain hands-on experience setting up, maintaining, and troubleshooting information technology systems, including hardware, networking, and communications equipment. Cadets assist in designing and developing digital tools using low-code platforms. They work with stakeholders to identify operational needs, gather requirements, and contribute to innovative solutions that improve efficiency and communication. This position builds technical proficiency, digital problem-solving, project management, and teamwork skills while providing exposure to digital transformation strategies and emerging technologies.",
        "Seamanship (Sea)": "The Seamanship Course allows cadets to build on their basic seamanship skills through advanced activities such as ropework, rigging, crew duties in vessel operations, day sailing on a training vessel, and naval communication. Upon successful completion, cadets earn Communications 1 and 2 qualifications, which certify their ability to effectively use naval communication equipment and protocols in maritime operations.",
        "Ship's Boat Operator (SBO)": "The Ship’s Boat Operator Course helps cadets develop advanced seamanship skills through Small Craft Operator Program (SCOP) training. Activities include ropework, marine navigation, naval visual communication, and a multi-day on-water trip. Successful cadets earn SCOP 2, which qualifies them to obtain the Restricted Operator’s Certificate for Maritime (ROC(M)) with Digital Selective Calling (DSC) endorsement, allowing them to operate marine radios; SCOP 3, certifying them to operate powerboats with outboard engines; and a standard first aid qualification for emergency medical response.",
        "Sail 1 Course (S1)": "Sail Course 1 offers cadets the chance to develop basic sailing skills and participate in Small Craft Operator Program (SCOP) training. Successful cadets earn CANSail 1 and 2 qualifications, which certify fundamental sailing competencies, and the SCOP Module 1 Pleasure Craft Operator Card (PCOC), a mandatory certificate for operating pleasure crafts in Canadian waters.",
        "Sail 2 Course (S2)": "Sail Course 2 helps cadets advance their sailing abilities with more complex skills and training. Successful participants earn CANSail 3 and 4 qualifications, demonstrating intermediate sailing proficiency, Standard First Aid certification for emergency medical response, and SCOP Module 3 certification, qualifying them to operate powerboats safely.",
        "Sail 3 Course (S3)": "Sail Course 3 offers cadets the opportunity to further enhance their sailing skills and qualify as sail instructors. Successful cadets earn CANSail 5 and 6 qualifications, demonstrating advanced sailing proficiency, SCOP Module 4 certification for powerboat rescue operations, Sail Canada Fundamental Training Course completion, Instructor Clinic certification, and Safe Sport training, equipping them to teach sailing safely and effectively.",
        "Expedition Team Leader (ETL)": "The Expedition Team Leader course trains cadets to plan, lead, and manage outdoor expeditions. Participants develop skills in navigation, risk management, group leadership, and emergency response. Successful candidates earn qualifications demonstrating their ability to safely organize and lead teams in challenging wilderness environments.",
        "Expedition Team Member (ETM)": "This course prepares cadets to effectively participate in outdoor expeditions by building skills in teamwork, navigation, survival, and physical endurance. Cadets learn to be a team member and contribute to the success and safety of group outdoor activities, earning a qualification that reflects their capability as reliable expedition members.",
        "Mountain Bike Instructor (MBI)": "The Mountain Bike Instructor course equips cadets with the knowledge and skills to teach mountain biking techniques, trail safety, and bike maintenance. Cadets learn instructional methods to train others, promoting safe and confident riding in varied outdoor terrains, and earn a qualification certifying their ability to lead mountain bike training sessions.",
        "CAF Basic Parachutist Course (BPC)": "The CAF Basic Parachutist Course offers participants the chance to learn essential skills and knowledge needed to become a basic paratrooper. Those selected for this course engage in challenging physical training in remote locations and at high altitudes. Upon successful completion, participants earn the Canadian Forces Basic Parachutist qualification, demonstrating their ability to safely perform military parachute operations.",
        "Aviation Technology and Aerospace (ATA)": "This course introduces cadets to foundational aerospace engineering concepts, including principles of flight, aircraft design, propulsion systems, and basic aerodynamics. Cadets also study airport operations and air law fundamentals such as regulations governing airspace and aircraft operations. The course develops technical skills in problem-solving, systems analysis, and understanding maintenance processes relevant to aerospace engineering and aviation operations.",
        "Advanced Aviation Course (AAC)": "Cadets build specialized knowledge in aviation communication systems, meteorology, and instructional techniques. Training emphasizes aviation operational procedures, air traffic management principles, and leadership skills required to coordinate aviation activities. This course prepares cadets to effectively lead aviation teams and instruct peers in complex aviation topics.",
        "Glider Pilot Training Course (GPTC)": "An intensive flight training program focusing on the theory and practice of unpowered flight. Cadets learn glider aerodynamics, flight controls, navigation, weather assessment, emergency procedures, and regulatory requirements. Successful completion results in the Transport Canada Glider Pilot License, certifying independent glider operation and enhancing practical understanding of flight dynamics and air law.",
        "Power Pilot Training Course (PPTC)": "Comprehensive training in powered flight covering aircraft systems, flight planning, navigation, meteorology, and emergency protocols. Cadets gain hands-on piloting experience and study aviation regulations and air law in depth. Graduates earn the Transport Canada Power Pilot License, qualifying them for solo operation of powered aircraft and advancing their operational knowledge of aviation safety and management.",
        "Introduction to Survival (ITS)": "Cadets acquire essential survival skills tailored to aircrew, including navigation, emergency preparedness, and wilderness survival techniques. The course emphasizes situational awareness, risk assessment, and decision-making, which are critical for aircrew safety during unexpected situations.",
        "Survival Instructor Course (SI)": "This advanced course prepares cadets to instruct and lead survival training programs. Participants deepen their expertise in survival tactics, map and compass navigation, team and solo exercises, and develop effective teaching methods. Graduates are equipped to train others in aircrew survival skills, supporting operational readiness and safety.",
        "Cyber Safety and Security Team Leader (CSSTL)": "This course equips cadets with the technical and leadership skills necessary to support cybersecurity awareness and operations within their units. Cadets learn to identify security features in Windows and Linux systems, practice ethical digital behavior, and participate in a simulated cybersecurity competition. Through collaboration with Canadian Armed Forces cyber experts, cadets gain experience in digital risk management and information security protocols. Successful completion results in a Cyber Leader certification, demonstrating readiness to lead cyber safety training and foster secure online habits in the cadet community.",
        "Support Services Team Leader (SSTL)": "Cadets learn about the administrative and logistical functions that support unit operations, including supply chain management, document handling, inventory control, and data privacy. The course focuses on behind-the-scenes leadership, organizational efficiency, and administrative problem-solving. Cadets build competencies in digital documentation, teamwork, accountability, and time management. Completion includes WHMIS Certification, demonstrating knowledge of safe material handling in workplace and supply environments.",
        "Small Craft Coxswain (SCC)": "Cadets gain skills in operating small vessels, interpreting marine navigation rules, and executing on-water communication using distress signals and Maritime Mobile Service procedures. The course emphasizes hands-on training in vessel maneuvering, safety procedures, and emergency readiness. Successful cadets earn SCOP Module 1 certification (Transport Canada Pleasure Craft Operator Card) and SCOP Module 2 certification (Restricted Radio Operator’s Certificate - Maritime), qualifying them to safely operate pleasure craft and communicate using marine radio equipment.",
        "Basic Microdrone Operator (BMDO)": "This course introduces cadets to microdrone operation and UAV (Uncrewed Aerial Vehicle) regulations in Canada. Cadets learn airspace safety, mission planning, emergency procedures, and drone applications in the Canadian Armed Forces. Training includes preparation for the Transport Canada Pilot Certificate – Basic Operations and the Aeronautical Restricted Operator Certificate, providing nationally recognized qualifications for drone operation and aeronautical radio use. The course develops spatial awareness, responsibility, and technical competence in remote aircraft systems.",
        "Nova Quest (NQ)": "Cadets explore Canada's aerospace history, space technology development, and the future of space travel. Activities simulate life in space, covering survival techniques, communication systems, and extraterrestrial navigation. Cadets analyze celestial bodies, learn about space missions, and engage in technology-based problem-solving. The course cultivates curiosity, scientific thinking, adaptability, and teamwork within the context of Canada's growing aerospace industry.",
        "Basic Coder (BC)": "This course introduces cadets to the fundamentals of programming and digital problem-solving. Cadets use visual block coding tools such as Minecraft and VR-based robots to develop logic, creativity, and structured thinking. They also engage in eSports competitions and discussions with Canadian Armed Forces personnel about cybersecurity and tech careers. The course strengthens digital literacy, collaboration, innovation, and systems thinking—key skills in both civilian and military technology environments."

    },
    "qualifications": {
        "Emergency First Aid": "Certifies cadets in basic life-saving procedures including CPR, AED usage, and emergency response for life-threatening situations. Cadets demonstrate situational awareness, decision-making under pressure, and personal responsibility in crisis settings.",
        "Standard First Aid": "An advanced certification that includes care for bleeding, burns, fractures, and environmental emergencies in addition to CPR and AED use. Cadets demonstrate skills in medical triage, communication in emergencies, and leadership under stress.",
        "Glider Pilot Front Seat Familiarization": "Cadets are certified to fly familiarization flights with cadets in the back seat of the aircraft. They demonstrate advanced airmanship, and safety while building confidence, technical awareness, and teamwork.",
        "Glider Pilot Back Seat Familiarization": "This qualification provides cadets the certification to fly familiarization with cadets in the front seat of the glider, enhancing their understanding of flight operations, situational awareness, and communication with passengers.",
        "Marksman": "Awarded for meeting air rifle shooting standards at the basic level. Cadets demonstrate precision aiming, stable firing position, and range safety procedures, building focus, responsibility, and attention to detail.",
        "First Class Marksman": "Recognizes increased marksmanship accuracy and discipline. Cadets refine breathing techniques, target consistency, and self-discipline during extended shooting sessions.",
        "Expert Marksman": "Awarded for high-performance grouping and shot consistency. Cadets demonstrate expert-level focus, muscle control, and psychological steadiness under pressure.",
        "Distinguished Marksman": "The highest level of air rifle marksmanship. Cadets exhibit elite precision, concentration, and flawless adherence to safety and technique across multiple assessments.",
        "Basic Music Qualification": "Cadets demonstrate basic listening, coordination, and performance skills, as well as how to be part of a military band.",
        "Music Level 1": "Cadets show early-stage musical proficiency and ensemble integration. They gain confidence, timing, and cooperation in group performances.",
        "Music Level 2": "Cadets perform more complex music, read advanced notation, and play with increased accuracy. They develop leadership potential and communication within musical sections.",
        "Music Level 3": "Demonstrates intermediate performance ability and musical technique. Cadets begin mentoring peers and taking on section leadership responsibilities.",
        "Music Level 4": "Cadets show strong musical interpretation, endurance, and ensemble leadership. This level requires problem-solving in group dynamics and a mature understanding of musical structure.",
        "Music Level 5": "Represents mastery in performance, technique, and musical leadership. Cadets direct sections or full ensembles, lead rehearsals, and model professionalism and precision.",
        "Physical Fitness Bronze": "Awarded for meeting basic fitness standards. Cadets develop foundational physical abilities, goal-setting habits, and personal accountability.",
        "Physical Fitness Silver": "Recognizes intermediate performance in strength and cardio benchmarks. Cadets build endurance, motivation, and resilience through structured fitness routines.",
        "Physical Fitness Gold": "Awarded to cadets showing consistent improvement and strong overall fitness. They model self-discipline and inspire others in physical challenges.",
        "Physical Fitness Excellence": "The highest fitness recognition for cadets, requiring exceptional performance across all test categories. Cadets demonstrate perseverance, leadership in fitness environments, and excellence in physical well-being.",
        "SCOP Module 1 – Pleasure Craft Operator Card (PCOC)": "Certifies cadets in Transport Canada's mandatory boating safety course. Topics include regulations, navigation lights, buoy systems, and emergency procedures. Cadets develop safe boating habits, regulatory knowledge, and preparedness for on-water emergencies.",
        "SCOP Module 2 – Restricted Operator Certificate (Maritime)": "Grants cadets legal authority to operate marine radios. Training covers VHF operation, DSC protocols, emergency signals, and distress communication. This qualification fosters precision, calmness during emergencies, and technical radio proficiency.",
        "SCOP Module 3 – Powerboat Operator": "Focuses on practical powerboat operations including navigation, docking, and engine management. Cadets learn route planning, fuel efficiency, and mechanical troubleshooting, building independence and responsibility for watercraft handling.",
        "SCOP Module 4 – Safety/Rescue Boat Operations": "Prepares cadets for rescue procedures, including man-overboard recovery, vessel towing, and search coordination. Cadets develop rapid decision-making, teamwork under stress, and advanced marine safety techniques.",
        "CANSail 1": "Introduces cadets to the basics of sailing, including boat handling, safety, sail trim, and terminology. Cadets build physical coordination, environmental awareness, and beginner-level problem solving on the water.",
        "CANSail 2": "Builds on Level 1 with improved sail control, basic tacking and gybing, and right-of-way rules. Cadets increase confidence, consistency, and adaptability in unpredictable weather conditions.",
        "CANSail 3": "Intermediate sailing course emphasizing efficiency and technique. Cadets learn advanced maneuvers, risk assessment, and begin to lead smaller group sailing activities, improving analytical thinking and responsibility.",
        "CANSail 4": "Cadets refine their sailing skills through race-oriented training, wind optimization, and tactical sailing. The course encourages critical decision-making, self-assessment, and instructional ability under time constraints.",
        "CANSail 5": "Advanced-level sailing that introduces spinnaker use, heavy weather techniques, and team strategy. Cadets manage crew coordination and take leadership in boat operations under challenging conditions.",
        "CANSail 6": "Mastery of technical sailing including advanced tactics, speed optimization, and multi-crew coordination. Cadets learn coaching skills, refine their sailing leadership, and practice competitive sailing strategies.",
        "Sail Instructor": "Cadets are certified to instruct sailing under Sail Canada. This includes lesson planning, student safety, and course delivery. It strengthens instructional technique, public speaking, and mentoring skills in a technical sport environment.",
        "Safety Boat Operator": "This qualification focuses on rescue readiness and safe escort duties during on-water cadet activities. Cadets learn emergency procedures, boat handling under stress, and coordination with safety teams. The course strengthens judgment, risk management, and the ability to remain calm during high-pressure incidents.",
        "Sea Boat Coxswain": "Cadets lead a small boat crew in navigation, communication, and operations at sea. This role demands advanced seamanship, leadership, and the ability to direct personnel under changing marine conditions. Cadets refine coordination, assertive communication, and on-water leadership in real-time operations.",
        "Scuba Diving Qualification": "Introduces cadets to basic scuba diving techniques and equipment safety. Cadets develop underwater navigation, pressure awareness, buddy-system communication, and environmental respect through hands-on training with certified instructors.",
        "Communicator Level 1": "Cadets develop foundational skills in signaling method—flags and pennants, ROC-M, or semaphore. This qualification introduces the principles of communication, building confidence and precision in transmitting clear messages under operational conditions.",
        "Communicator Level 2": "Cadets expand their capabilities by mastering any two signaling methods from the following: flags and pennants, ROC-M, and semaphore. This qualification enhances adaptability and coordination, preparing cadets to communicate effectively in varied environments where combined signaling techniques are essential.",
        "Communicator Level 3": "Cadets achieve full communicator qualification by demonstrating proficiency in all three methods: flags and pennants, ROC-M, and semaphore. This advanced level equips cadets with versatile communication skills vital for leadership and teamwork in complex, real-world operations.",


    },
    "awards": {
        "Cadet Award for Bravery": "Awarded to cadets who demonstrate extraordinary courage by risking their lives to save others or protect property. Recognizes quick thinking and heroic actions performed under life-threatening circumstances, exceeding expectations of personal safety and duty.",
        "Lord Strathcona Medal": "The highest award for physical and military excellence in the Cadet Program. Recognizes cadets who consistently demonstrate exemplary leadership, discipline, physical fitness, and dedication to the ideals of cadet training. Recipients set the standard in their corps or squadron.",
        "Royal Canadian Legion Cadet Medal of Excellence": "Awarded to cadets who show exceptional citizenship, leadership, and community service. Recipients must have completed all mandatory training and participated in multiple community service events. This medal highlights civic responsibility and cooperation within and beyond the cadet unit.",
        "Navy League of Canada Medal of Excellence": "Presented annually to the top Sea Cadets at each corps. Recognizes outstanding performance, leadership, community involvement, and adherence to the values of the Sea Cadet program. Recipients act as role models in both maritime service and conduct.",
        "Divisional Sea Cadet of the Year": "Awarded to one Sea Cadet per division in Canada for exceptional leadership, citizenship, and dedication. Selected through regional nominations and interviews, recipients demonstrate a positive impact within their unit and serve as ambassadors for the Sea Cadet program.",
        "National Sea Cadet of the Year": "The most prestigious Sea Cadet honour in Canada. Selected from divisional winners, this award recognizes the cadet who best represents the core values of the program through leadership, service, and public engagement at the national level.",
        "Major-General W.A. Howard Award": "Presented to the top Army Cadet in each province. Recognizes cadets who exemplify excellence in leadership, training, community service, and overall performance. Named in honour of a former Chief of Reserves and Cadets, it reflects the highest provincial standard in Army Cadets.",
        "RCAF Association Medal": "Awarded to the top cadet graduating from the Glider or Power Pilot Training Courses. Sponsored by the Royal Canadian Air Force Association, it honours outstanding leadership, flying proficiency, and contributions to the aviation program during summer training.",
        "ANAVETS Cadet Medal of Merit": "Awarded to top cadets on instructor-level courses, such as Drill & Ceremonial, Survival, Fitness & Sports, Marksmanship and other elemental courses, demonstratinng impeccable tructional ability, and overall course performance. Sponsored by Army, Navy, and Air Force Veterans in Canada.",
        "Order of St. George Medal": "Awarded to cadets who demonstrate sustained excellence in leadership, service, and commitment to the cadet movement during summer training. Recognizes honour, duty, and personal integrity. Often presented during national events or leadership roles in large-scale cadet activities.",
        "Sea, Army, and Air Cadet Service Medals": "Awarded to cadets after four years of honourable service in the program. Additional bars recognize each subsequent year. Symbolizes dedication, loyalty, and perseverance throughout a cadet’s time in the program.",
        "Canada Company Youth Excellence Award": "Recognizes cadets who demonstrate balanced excellence in academics, leadership, and community service. Recipients show initiative, civic engagement, and personal integrity. Selected nationally, they serve as ambassadors of youth achievement across Canada.",
        "Command Commendation": "Awarded by the Formation Commander to individuals or groups for exceptional leadership, service, or innovation. Recognizes contributions that enhance training, improve morale, or solve problems beyond the scope of regular duty."
    }
}